# %% 
devtools::load_all("../../..")
p_load(Ipaper)

# %% 
f = "呼中_Met_日尺度数据_2014_2018.csv"
l = read_ufile(f)

# %% 
l$data[Ts_5_AVG > 10, .(yyyy, mm, dd, Ts_5_AVG)]
l$data[Ts_5_AVG > 20, `:=`(Ts_5_AVG = NA_real_)]

write_ufile(l, f)

# %% 检查降水
f = "呼中_Met_30min_2014_2018.csv"
l = read_ufile(f)
d = l$data

## 呼中：降水观测记录不全，除下述月份外，其余月份无降水

#  3  2014     3   0.1
#  4  2014     4   1.3
#  5  2014     5  55.3
#  6  2014     6  29.8

# 18  2015     6   1.1
# 19  2015     7  74.8
# 20  2015     8 186. 
# 21  2015     9  40.4
# 22  2015    10  13.2
# 23  2015    11   0.8

# 27  2016     3   0.3
# 28  2016     4  16.8
# 29  2016     5  18.3
# 30  2016     6  74.1
